In [2]:
import pandas as pd

In [4]:
df_customers=pd.DataFrame({
    "customer_id":[1,2,3,4],
    "name":["riya","radhika","mahi","charlie"]
})

df_orders=pd.DataFrame({
    "order_id":[101,102,103,104],
    "customer_id":[2,1,4,5],
    "amount":[250,120,300,180]
})

In [6]:
df_customers

   customer_id     name
0            1     riya
1            2  radhika
2            3     mahi
3            4  charlie

In [8]:
df_orders

   order_id  customer_id  amount
0       101            2     250
1       102            1     120
2       103            4     300
3       104            5     180

In [10]:
pd.merge(df_customers,df_orders,on="customer_id")#inner join

   customer_id     name  order_id  amount
0            1     riya       102     120
1            2  radhika       101     250
2            4  charlie       103     300

In [13]:
pd.merge(df_customers,df_orders,on="customer_id",how="left")#left join

   customer_id     name  order_id  amount
0            1     riya     102.0   120.0
1            2  radhika     101.0   250.0
2            3     mahi       NaN     NaN
3            4  charlie     103.0   300.0

In [15]:
pd.merge(df_customers,df_orders,on="customer_id",how="right")#right join

   customer_id     name  order_id  amount
0            2  radhika       101     250
1            1     riya       102     120
2            4  charlie       103     300
3            5      NaN       104     180

In [17]:
pd.merge(df_customers,df_orders,on="customer_id",how="outer")#outer join

   customer_id     name  order_id  amount
0            1     riya     102.0   120.0
1            2  radhika     101.0   250.0
2            3     mahi       NaN     NaN
3            4  charlie     103.0   300.0
4            5      NaN     104.0   180.0

In [19]:
#concatenation

df1=pd.DataFrame({
    "id":[1,2,3],
    "name":["adam","eve","dave"]
})

df2=pd.DataFrame({
    "id":[4,5,6],
    "name":["riya","radhika","mahi"]
})

In [20]:
df1

   id  name
0   1  adam
1   2   eve
2   3  dave

In [21]:
df2

   id     name
0   4     riya
1   5  radhika
2   6     mahi

In [25]:
pd.concat([df1,df2])

   id     name
0   1     adam
1   2      eve
2   3     dave
0   4     riya
1   5  radhika
2   6     mahi

In [28]:
pd.concat([df1,df2],ignore_index=True)#row

   id     name
0   1     adam
1   2      eve
2   3     dave
3   4     riya
4   5  radhika
5   6     mahi

In [29]:
pd.concat([df1,df2],axis=1)#col

   id  name  id     name
0   1  adam   4     riya
1   2   eve   5  radhika
2   3  dave   6     mahi